using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Saveur.model
{
    public static class Ascii
    {

        
        public static void king()
        {
            Console.SetCursorPosition(0, 4);
            Console.WriteLine(@"                
                   / \
                  _\ /_
        .     .  (,'v`.)  .     .
        \)   ( )  ,' `.  ( )   (/
         \`. / `-'     `-' \ ,'/
          : '    _______    ' :
          |  _,-'  ,-.  `-._  |
          |,' ( )__`-'__( ) `.|
          (|,-,'-._   _.-`.-.|)
          /  /<( o)> <( o)>\  \
          :  :     | |     :  :
          |  |     ; :     |  |
          |  |    (.-.)    |  |
          |  |  ,' ___ `.  |  |
          ;  |)/ ,'---'. \(|  :
      _,-/   |/\(       )/\|   \-._
_..--'.-(    |   `-'''-'   |    )-.`--.._
         `.  ;`._________,':  ,'
        ,' `/               \'`.
             `------.------'   ");
        }

        public static void Camp()
        {
            Console.SetCursorPosition(0, 4);
            Console.WriteLine(@"     
           (                 ,&&&.
            )                .,.&&
           (  (              \=__/
               )             ,'-'.
         (    (  ,,      _.__|/ /|
          ) /\ -((------((_|___/ |
        (  // | (`'      ((  `'--|
      _ -.;_/ \\--._      \\ \-._/.
     (_;-// | \ \-'.\    <_,\_\`--'|
     ( `.__ _  ___,')      <_,-'__,'
      `'(_ )_)(_)_)'                    ");
        }


        public static void Garden() 
        {
            Console.SetCursorPosition(0, 4);
            Console.WriteLine(@" 
                                        E   _
                                         \  o
                .|.:.|.:.|.:.|.:.|.:.|.   \/()
             \cjr//\/'.'.'.'.'.'.\//\\//\/ \7] \__,
          \/\\//\\/'.'.'.'.'.'.'.'\//\\//\/<,] /==()
        .:.|.:.|.:.|.:.|.:.|.:.|.:.|.:.|.:.|.");
        }


        public static void dodo()
        {
            Console.SetCursorPosition(0, 4);
            Console.WriteLine(@" 
                              z
                             z
                              Z
                    .--.  Z Z
                   / _(c\   .-.     __
                  | / /  '-;   \'-'`  `\______
                  \_\/'/ __/ )  /  )   |      \--,
                  | \`""`__-/ .'--/   /--------\  \
                   \\`  ///-\/   /   /---;-.    '-'
                                (________\  \
                                          '-' ");
        }

        public static void kinghtWin() 
        {
            Console.SetCursorPosition(0, 4);
            Console.WriteLine(@"

                                         /'
                                         ||
                                         ||      ** *
                                         ||      __X_
                                         ||     ( ___\
                                         ||     |:  \\
                                        ><><  ___)..:/_#__,
                                        (X|) (|+(____)+\ _)
                                         o|_\/>> + + + << \
                                           |:\/|+ + + +| \_\<
                                           \./  XXXXXX.  (o_)_
                                               /+ + + |   \:|
                                              /+ +/+ +|  -/->>>----.
                                             /+ +|+ /XX /   _--,  _ \
                                            \+ + + /  |X   (,\- \/_ ,
                                            /\+ + /\  |X \    /,//_/
                                           +_+_+_( )o_)X  \  (( ///
                                            (_o(  /__/ X   \  \\//
                                             \_|  |_/  X    \ ///
                                             \_| >(_/        \,/
                                        ,////__o\ /__////,    V ");
        }


        public static void chatiment()
        {
            Console.WriteLine(@"
                                            *_   _   _   _   _   _ *
                                      ^       | `_' `-' `_' `-' `_' `|       ^
                                      |       |                      |       |
                                      |  (*)  |_   _   _   _   _   _ |  \^/  |
                                      | _<"">_ | `_' `-' `_' `-' `_' `| _(#)_ |
                                     o+o \ / \0                      0/ \ / (=)
                                      0'\ ^ /\/                      \/\ ^ /`0
                                        /_^_\ |                      | /_^_\
                                        || || |                      | || ||
                                        d|_|b_T______________________T_d|_|b ");
        }

        public static void Marchant()
        {
            Console.WriteLine(@"
                           \_____________________/
                            \       __O__       /
                             \      =(_)=      /              +
            +                _\  ___________  /_         .  . . .
             . . +          ( \\/ ___   ___.\// )       +.. .. .+
             .. .. :         \    (o)) ((o)    /       ... .. . .
            .. : .. .:. .    (_)    /   \    (_)      ..+.. + ...+
            . .+ . ++. .       \:. (_   _) .:/         +  + :.. + :
             . __... . +        )::::\_/::::(            :. __  . .
             _(  \ __ .        (:::\_|_|_/:::)          __ /  )_
            (  \  (  \      __  \:::\_|_/:::/  __      /  )  /  )
             \  \  \  \    /  )  \:::::::::/  (  \    /  /  /  /
            ( \  \  \  \__/  /    |\:::::/|    \  \__/  /  /  //)
             \ \_ \_ \_     / ____| |___| |____ \     _/ _/ _/ /
              \            /_/ ||   |___|   || \_\            /
               \          /\   ||  (_____)  ||   /\          /
                \________/ \\  ||___________||  // \________/
   ______________\\_______//    |___________|   \\______//_______________
                  \______/_:                   :_\______/");
        }

        public static void achatpossible()
        {
            Console.WriteLine(@"

                +- - - - - - - - - - - - - - - - - - - - - - - - - - +
                |                                                    |
                |    Trèfle a 4 feuilles :        10 po              |
                |    Fer à cheval :               25 po              |
                |    Bracelet de chance :         40 po              |
                |    Os de poulet :               55 po              |
                |    Chapeau de chance :          70 po              |
                |                                                    |
                +- - - - - - - - - - - - - - - - - - - - - - - - - - +");
        }

        public static void ventreobjet()
        {
            Console.WriteLine(@"

                +- - - - - - - - - - - - - - - - - - - - - - - - - - +
                |                                                    |
                |    Carotte :                     1 po              |
                |    Navet :                       5 po              |
                |    Viande crue :                 2 po              |
                |    Légume Griller :              4 po              |
                |    Viande Griller  :             4 po              |
                |    Ragout :                      5 po              |
                |                                                    |
                +- - - - - - - - - - - - - - - - - - - - - - - - - - +");
        }

        public static void Manger()
        {
            Console.WriteLine(@"

                               .-'''''-.
                                       |'-----'|
                                      /`-.....-`\
                                      | <_}     |
                                      |  .-\-.  |
                   _,._               | /# `  \ |
              __.-`    `""""""-.         | \     / |
         ..--'   `""-.        `)_,._   \  '-'-'  /
       (`            )--.-""```     `""-.`'-----'`
        '-----------'  (               )
                        `-------------`");
        }

        public static void craft()
        {
            Console.WriteLine(@"

                       .--,--.
                       `.  ,.'
                        |___|
                        :o o:   O    Let me cook 
                       _`~^~'_  |    
                     /'   ^   `\=)
                   .'  _______ '~|
                   `(<=|     |= /'
                       |     |
                       |_____|
                ~~~~~~~ ===== ~~~~~~~~




");
        }

    }



}
